[
    {
        "Term": "2 factor authentication (2FA)",
        "Link": "https://www.infobip.com/glossary/2-factor-authentication",
        "Definition": "Two factor authentication, also known as 2FA, is an extra layer of security that requires users to use both their online password and their mobile phone to verify their identity.",
        "null": [
            "What is 2FA (Two Factor Authentication), and how can you implement it?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Your customers’ security should be one of your highest priorities. Learn about 2FA and how it can help you protect your customers. | Dan Mekinec | Senior Content Marketing Specialist | 2FA is short for Two Factor Authentication.It refers to a security process that requires users to provide two forms of identification to verify their identity before accessing an account or making a transaction. This extra layer of security typically involves using an online password and another device, like a mobile phone. | The most popular form of 2FA is when a customer logs in to their account using a password, after which they receive aone time pin (OTP)to confirm their identity. An OTP or 2FA PIN is a code that is automatically generated and sent, usually to a mobile device, to allow a single login session or transaction. | Here is an example of a 2FA process where customers can choose the channel they want to use for authentication: | Step 1:Users initiate the 2FA process and see a prompt asking them which channel they want to use. | Step 2:After choosing the channel, users receive their verification code. | Step 3:Users enter the verification code in the app or web, authenticating the transaction. | The main benefit of 2FA is that it provides anextra layer of security,making it harder for attackers to access accounts. Simply adding a layer of 2FA to logins and transaction processes can alleviate risks of stolen data.According to Verizon,80% of cyber breachescould be prevented by 2FA. | As a method ofmulti factor authentication (MFA), it helps ensure online accounts and transactions are safe from fraudsters’ many tactics, including email phishing,smishing, andSIM swapping.Google reportedthat 100% of automated bots, 99% of phishing attacks, and 66% of targeted attacks wereblocked by two factor authentication. | 99% | of phishing attacks were blocked by 2FA. Source:Google | Here is an overview of the benefits of 2FA in more detail: | It’s not easy for a hacker to bypass 2FA, making it an effective security tool against fraud. Hackers would have to know lots of information to gain access and duplicate information, not just one password. | Turning on two factor authentication is an easy way to stay protected. Even the simplest form of 2FA puts a practicallyimpenetrable wallbetween hackers and your customers’ personal information. | Taking these steps to protect your customers’ accounts will offer them the highest level of security and the best UX, creating happy and secure customers all around. | The goal of 2FA is to secure personal information while still providing asmooth user experience. In the case ofpush notifications, there’s no need to enter a PIN to confirm the authentication. A simple click is all that’s required. | Tip: Using anomnichannel 2FA solution, you can allow customers to choose the channel that best suits them, putting UX and security first. | Example of anOTP code delivered on WhatsApp. | Companies that embracenew technologyare likely to experience better productivity and flexibility. Customers can sign up for services faster and more securely than before. | Today, businesses use 2FA so their employees can securely access corporate applications, data, documents, and back office systems from virtually any location without putting company data at risk. | Implementing 2FA can help reduce the lengthy and costly password reset calls and can act as a secure way for customers to sort these issues out themselves. | Reducing customer interactions with call centers, not only strengthens security but also improves UX. Then, as a massive bonus, operational overheads that are associated with security controls are reduced. | Havingstronger security measures for ecommerce sites increases consumers’ trust. Consumers are more likely to trust other consumers on sites like eBay or PayPal knowing that everyone on the system must pass through the same tight security as they did. Building a large circle of trust within the community—especially with services like eBay and Etsy—is essential to these services’ long term success. | It is common and crucial for banks and financial institutions to use 2FA services. From requiring a PIN to access your bank card, to a TOTP (time based one time password) to finalize money transfers, 2FA keeps customers’ banking information safe and secure. | Related customer story: | 20% | 20%month on month registered user growth | Online retailers often use 2FA during the login process. When credit card information can be saved and stored on their accounts, adding an extra layer of protection is essential for customers to feel safe buying from their sites. | Healthcare organizations are responsible for securing patient data and information. Using 2FA, they can reassure their patients that only they can access their medical records. 2FA is also required for doctors to access patient files. | Governments have had to shift to using online and cloud based platforms for people to access their government accounts. This can include anything from student loan accounts, retirement savings, applications for driver’s licenses, and other government services. | Using 2FA offers the safest and most user friendly experience. People can now securely access many government documents and records online without hassle. This makes using government sites easier than ever. | With almost 100%mobile phone ownershipin most major markets, OTP (PIN codes) sent to a mobile device isthe most common method of 2FA implementation. | However, it is crucial to choose the best channel for sending the PIN, depending on the individual use case and the preferences of each customer. | For example, some people may live or work in places with unreliable mobile or data signals. So, configuring afailover channelis key to ensuring that codes are delivered securely and before they expire in cases where time based one time PINs (TOTPs) are used. | The most popular methods of 2FA include: | You should ensure 2FA is used as effectively and efficiently as possible to ensure your customers do not get inconvenienced and associate increased security with increased hassle. | An effective authentication solution should be able toautomatically select the best primary and failover channeland trigger delivery of the OTP on the second channel when the first is not successful. This ensures that 2FA PIN codes are always delivered. | This is where aflexible omnichannel authentication solutionbecomes crucial, as it reduces the overall overhead for the organization by ensuring that human intervention is only required when necessary. | If a person is impatient to receive an OTP they might click on the ‘send a new code’ option. Every time a person does this it translates to additional costs for your business. | An effective 2FA re send strategy incorporates a set of rules for requesting OTPs that balances the security of the customer with the costs for the business. | For example, how often can a user request a new verification PIN? Will all PINs be sent via the same channel? Can the same PIN be reused? All these questions are covered by an effective 2FA resend strategy. | The benefits of a 2FA resend strategy are clear: | Checklist for creating a resend strategy | 1. Give users the option to select their preferred method of OTP delivery | By giving users choice it allows them to select the best option in situations where they may not have access to a mobile or data signal. This increases delivery rates and reduces costs as it reduces OTP resend requests. | Offer at least two of the most common options – SMS, WhatsApp, Voice, Email, or push notifications from your app. | 2. Set a time limit before allowing a resend request | The sweet spot for a buffer period is generally between 30 to 60 seconds for the first attempt and 60 to 90 seconds for the second attempt. After that, you can extend to a slightly longer time, for example 5 minutes. | A good option is to change the color of the ‘Re send verification code’ button or grey it out until the buffer period is up. In addition, you could add a timer so that the user knows when they will be able to request a new code. | 3. Restrict the number of PINs that can be sent per day | This is an important tactic to preventSMS pumping fraudwhich happens when fraudsters use bots to make multiple fake OTP requests to a business, causing a spike in their costs. To prevent this, you can restrict the number of PINs a user can request in a single day. For example, if they select five or more the service is temporarily blocked for 24 hours. | Where the service is temporarily blocked, it is important to offer an alternative for genuine users to resolve their problem, such as a chatbot, FAQ link, or helpdesk service. | 4. After a failed attempt ask users to verify their e mail/phone number | If a person enters the wrong phone number, they will never be able to receive the PIN number needed to complete the verification. To prevent this, you should ask the user to check or even re enter their email or phone number. | Another option is to use a solution such asNumber Lookup, which analyzes whether a number exists, whether it is a landline, and whether it is active before any kind of PIN is sent. You can then give genuine users the best chance to enter a valid number to receive their PIN. | 5. Set a time limit on your OTPs | It is very important that you restrict the time that a PIN code is valid for. The exact time period will depend on the type and value of the transaction – for a high value transaction the code should expire after a shorter period to reduce the chances of fraud. | Once the code has expired the user will have to request a new one to complete the verification process. | 6. Invalidate existing OTPs as soon as a new one is sent | If a user requests a new verification code, it is essential that you invalidate the code previously sent to prevent it being intercepted. This is especially relevant if your customer has changed channels between the first and second attempt. | 7. Monitor your OTP delivery metrics | To mitigate the effect of a fraud attack and to control costs you should continually monitor the metrics related to the delivery of your OTPs. It is especially important to look at the ratio between how many PINs were sent and how many were actually used. This should remain fairly steady; any significant jump in the ratio may indicate a fraud attack. | When monitoring your OTP delivery status, it is worth separating the data by channel. Measuring conversion rates across channels will give you insights into how your customers are using your 2FA service and how you can fine tune your strategy to provide a better CX and reduce costs. | Withconversion tracking,you can measurehow many PINS are sent versus how many are used. This allows you to understand how your customers are using your 2FA service and how convenient it is for them. This additional insight can help you optimize your 2FA service, and make it easier to use. | Besides OTP code delivery, other important components of mobile 2FA security are performed silently in the background, strengthening the authentication process. | For example,Number Lookupis a great way to reduce costs and ensure a customer receives their PIN. By checking thestatus of a person’s phone number, you can ensure your customers receive their PIN on the channel that best suits them. | ForOTTbusinesses, if a customer enters the wrong phone number, they can never get the SMS with the PIN number necessary to complete the installation. They could lose an excellent way to stay in touch with their friends, while the app makers lose a potential user. Bearing in mind the intense competition in the messaging space, this is likely to be the last thing app makers want. | By offering detailed insight into mobile networks tocheck numbers for validity, number lookup is extremely beneficial to OTT providers. It can provide insight on if a number is nonexistent, unused or landline phone and offers customers the chance to re enter their phone number if it is incorrect. | Other security & fraud prevention services we recommend with 2FA: | At Infobip, we help businesses from global brands to independent retailers secure their customers and transactions. Our solution,Infobip Authenticate, is unique in the market as it incorporates multiple channels and analyses various factors, including cost and popularity, to determine the best channel for each OTP. | Currently available channels for optimized OTP delivery areSMS,RCS,WhatsApp,Voice,Viber,ZaloandKakaoTalk. This ensures that your OTPs are always delivered promptly and reliably in every destination. | Crucially, the solution is designed toblend seamlessly into existing business processesso that your customers benefit from an easy and consistent experience that reduces friction all the way from account registration to purchase. | Just some of the brands that trust Infobip to help with their authentication challenges include: | To conclude: by implementing quality 2FA solutions, you are signaling to customers and users that you take security seriously. This is increasingly important as we trust more of our digital lives to online services. | Verify your customers effortlessly using Infobip Authenticate, a robust omnichannel 2FA solution that provides a fully automated, cost effective way to authenticate customers. | How secure is 2FA? | 2FA is considered very secure, if a person’s authentication device (mobile phone) is not lost or stolen. In this scenario, it is theoretically possible that it could be used to access an account or validate a transaction if the person in possession of the phone also knew the rightful owner’s login details and password. | To add even more layers of security,biometric checkscan also be used, for example fingerprint, retina or face scans. Many modern smartphones already have biometric capabilities, although it can be quite challenging to integrate with every service. This is why solutions likeSMS OTPare still dominant worldwide. | How is 2FA better than passwords? | Remembering multiple passwords for every service can be frustrating. Many people get around this byusing the same password for multiple accounts– even those with less stringent security. This is a bad idea. | According to Verizon, in 2021, 82% of data breaches were due to poor password security that makes it easier for hackers to guess and access your data and information. | Here are somecommon mistakespeople make when creating a password: | Organizations can mitigate the risk by requiring customers to use longer and more complex passwords that are changed regularly. However, this will impact the customer experience by adding friction and annoyance. | Two factor authentication (2FA) solves this problem, especially with mobile devices always nearby as a quick means of verifying. | What are authentication factors? | Authentication factors are pieces of information you need to gain access to an account or make a transaction. | The first authentication factor required is simple – your username and password. However, on their own these do not provide sufficient security as they can often be guessed or stolen when hackers access an organization’s database that stores this information. | This is where multi factor (or multi step) authentication becomes crucial. In the case of 2FA, it requires two factors of authentication to verify your identity before you can complete an action. | There are three main types of authentication factors: | The most secure authentication solutions make use of multiple factors to suit each use case, and where OTPs are used – these can be sent on the best channel to ensure reliable deliverability and optimized costs for the organization. | What is 2FA pin? | A 2FA PIN is a code that is automatically generated and sent, usually to a mobile device, to allow a single login session or transaction. You cansee an example in this chapter. | This article was last updated in October 2024 to include more tips on 2FA implementation. | You may be interested in: | April 15, 2024 | April 5, 2024 | September 29, 2023 | Get the latest insights and tips to elevate your business | By subscribing, you consent to receive email marketing communications from INFOBIP. You have the right to withdraw your consent at any time using the unsubscribe link provided in all INFOBIP’s email communications. For more information please read ourPrivacy Notice | Share"
        ]
    },
    {
        "Term": "2 way SMS message",
        "Link": "https://www.infobip.com/glossary/2-factor-authentication",
        "Definition": "Two factor authentication, also known as 2FA, is an extra layer of security that requires users to use both their online password and their mobile phone to verify their identity.",
        "null": [
            "What is 2FA (Two Factor Authentication), and how can you implement it?"
        ]
    },
    {
        "Term": "2G mobile connection",
        "Link": "https://www.infobip.com/glossary/2-factor-authentication",
        "Definition": "Two factor authentication, also known as 2FA, is an extra layer of security that requires users to use both their online password and their mobile phone to verify their identity.",
        "null": [
            "What is 2FA (Two Factor Authentication), and how can you implement it?"
        ]
    },
    {
        "Term": "3 factor authentication (3FA)",
        "Link": "https://www.infobip.com/glossary/2-factor-authentication",
        "Definition": "Two factor authentication, also known as 2FA, is an extra layer of security that requires users to use both their online password and their mobile phone to verify their identity.",
        "null": [
            "What is 2FA (Two Factor Authentication), and how can you implement it?"
        ]
    },
    {
        "Term": "3G mobile connection",
        "Link": "https://www.infobip.com/glossary/2-factor-authentication",
        "Definition": "Two factor authentication, also known as 2FA, is an extra layer of security that requires users to use both their online password and their mobile phone to verify their identity.",
        "null": [
            "What is 2FA (Two Factor Authentication), and how can you implement it?"
        ]
    },
    {
        "Term": "4G mobile connection",
        "Link": "https://www.infobip.com/glossary/2-factor-authentication",
        "Definition": "Two factor authentication, also known as 2FA, is an extra layer of security that requires users to use both their online password and their mobile phone to verify their identity.",
        "null": [
            "What is 2FA (Two Factor Authentication), and how can you implement it?"
        ]
    },
    {
        "Term": "5G mobile connection",
        "Link": "https://www.infobip.com/glossary/2-factor-authentication",
        "Definition": "Two factor authentication, also known as 2FA, is an extra layer of security that requires users to use both their online password and their mobile phone to verify their identity.",
        "null": [
            "What is 2FA (Two Factor Authentication), and how can you implement it?"

        ]
    },
    {
        "Term": "10DLC",
        "Link": "https://www.infobip.com/glossary/2-factor-authentication",
        "Definition": "Two factor authentication, also known as 2FA, is an extra layer of security that requires users to use both their online password and their mobile phone to verify their identity.",
        "null": [
            "What is 2FA (Two Factor Authentication), and how can you implement it?"
        ]
    },
    {
        "Term": "15 bit Unicode",
        "Link": "https://www.infobip.com/glossary/2-factor-authentication",
        "Definition": "Two factor authentication, also known as 2FA, is an extra layer of security that requires users to use both their online password and their mobile phone to verify their identity.",
        "null": [
            "What is 2FA (Two Factor Authentication), and how can you implement it?"
        ]
    },
    {
        "Term": "Access point name (APN)",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | AnAccess point name, often abbreviated asAPN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet. | A mobile device making a data connection must be configured with an APN to present to a carrier. | Mobile devices connected to data transmitting carriers must be configured with APNs to transmit data. Carriers identify these devices to determine what network connection should be attributed to them (IP address attribution, security methods, and how and whether they should be connected to private customer networks). | APNs identify the packet data network (PDN) that mobile data users wish to communicate with. In addition to identifying a PDN, an Access Point Name may also be used to define the type of service (e.g., connection to a Wireless Application Protocol (WAP) server,Multimedia Messaging Service (MMS))that the PDN provides. APN is used in 3GPP data access networks). | An Access Point Name has a specific structure that helps mobile networks identify and connect devices to the appropriate data networks. | Network identifier: Specifies which external network the device is connecting to. This determines where to route the device’s data traffic. | Operator identifier: Identifies the specificMobile Network Operator (MNO)associated with the gateway. | A standard Access Point Name structure looks like this: | internet.mnc280.mcc234.gprs | Whether you need a private APN for your IoT deployment depends on a few crucial factors: | Here’s a breakdown of the challenges you might face if your APN settings are incorrect: | No data connection: The most common problem. With the wrong Access Point Name, your device won’t be able to establish a data connection with your mobile carrier’s network. This prevents you from accessing the internet or using data related apps. | Connection instability: In some cases, an incorrect APN might let you connect, but the connection will be unreliable, with frequent drops or slow speeds. | MMS issues: Incorrect MMS settings within the APN can block you from sending or receiving picture and video messages. | Tethering problems: If you want to use your phone’s data as a hotspot for other devices, incorrect APN settings can prevent this from working. | Carrier specific services: Some carriers have unique services (like visual voicemail or specific apps) that rely on configuring the correct APN. | Roaming charges: If traveling, an incorrect APN might prevent your device from connecting to the optimal local network, leading to unexpected and costly roaming fees. | Data overages: Without the correct Access Point Name, your device might inadvertently connect using a network with data charges different from what you expect. | Isolating the issue: When your internet doesn’t work, an incorrect APN might not be the first culprit that comes to mind. This makes the problem more challenging to diagnose for users not familiar with APN settings. | The severity of the problem depends on how incorrect the APN is. A single typo might cause limited issues, while a wrong APN usually blocks data entirely. | Some carriers auto configure APN settings, but there are still situations where manual input is needed (e.g., custom APNs, someMVNOs). | Here’s a step by step approach to resolve APN related challenges on your device: | Find the correct APN: Start by checking that the APN settings match those provided by your carrier. You’ll usually find this information on the carrier’s website or by contacting their support. | Check for typos: Carefully compare your current Access Point Name settings against the correct ones, watching for typos or incorrect values. Even a minor error can cause connectivity issues. | Built in reset: Most devices can reset Access Point Name settings to their default. This can often resolve minor discrepancies if the correct values aren’t readily available. | Caution: If you have a custom Access Point Name, resetting to default might clear the settings you want to keep – make a note of them first if needed. | Careful input: If you have the correct APN information from your carrier and previous steps didn’t work, input everything manually. Ensure all fields are filled in accurately. | Double check: Before saving, meticulously compare the values you entered against the information provided by your carrier. | Persistent issues: If the above steps fail to resolve the problem, contacting your carrier’s technical support is best. They may have additional troubleshooting steps or device specific guidance. | Account issues: Sometimes connectivity problems stem from account or provisioning issues, which only the carrier can address. | An Access Point Name is a gateway that allows you to connect to the Internet through your carrier network. In comparison,VPN stands for Virtual Private Network, a technology that creates a secure connection to another network over the Internet. | Does a VPN make me completely anonymous? | No, it significantly improves privacy but isn’t foolproof. Combine it with other good online security practices. | Can my employer see my activity if I’m using their VPN? | Yes, work provided VPNs often allow traffic to be monitored for security purposes. | Can a VPN protect me from viruses? | No, VPNs primarily secure your data in transit. Still, use antivirus software. | Share | December 12, 2023 | November 14, 2023 | March 29, 2023"
        ]
    },
    {
        "Term": "Access token",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "AI chatbot",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "AI Copilot",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "AI hallucinations",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "AIML",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "AI model collapse",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "AI red teaming",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "Alphanumeric sender ID",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "Apache",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "Application to person messaging (A2P)",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "App notification",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "Artificial general intelligence (AGI)",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "Average hold time (AHT)",
        "Link": "https://www.infobip.com/glossary/access-point-name",
        "Definition": "An Access Point Name, often abbreviated as APN, is the name of a gateway between a data transmitting mobile network and another computer network, frequently the public internet.",
        "null": [
            "What is an Access point name (APN)?"
        ]
    },
    {
        "Term": "BIMI",
        "Link": "https://www.infobip.com/glossary/brand-indicators-for-message-identification-bimi",
        "Definition": "Brand Indicators for Message Identification (BIMI), is an email parameter that allows email inboxes to show a brand’s logo next to their email messages.",
        "null": [
            "What is Brand Indicators for Message Identification (BIMI)?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Brand Indicators for Message Identification (BIMI), is an email parameter that allows email inboxes to show a brand’s logo next to their email messages. | BIMI benefits both sender and mailbox providers since it gives an additional layer of security. | Enhanced security and deliverability:You can’t have BIMI withoutDMARCimplementation, meaning you need an authentication tool that prevents data spoofing. | Increased brand recognition:It helps subscribers avoid phishing attempts. It is easier for customers to recognize the sender of the message. The BIMI framework has protection against illegitimate senders spoofing logos. | Better engagement:From a marketing perspective, it makes your message stand out and encourages receivers to open your emails. | If your company wants to implement BIMI, you must create and publish a new DNS (Domain Name System) record with a URL to your business’s logo. When the mailbox provider checks your DMARC, it will look for a BIMI record. If the record matches, they will display the logo next to your email. | Since BIMI is a relatively new technology, inbox providers that support BIMI as of June 2023 are Apple Mail, Google, Yahoo, Fastmail, Cloudmark, La Poste, Onet Poczta, and Zone. Providers considering BIMI include Yahoo Japan, GMX, Web.de, Seznam, Qualitia, Comcast, BT Mail, and Atmail. | Before implementing BIMI, you’ll need to do the following steps: | The first step, and the most important one, is setting up DMARC. All your emails must be authenticated usingSPFand/orDKIM. Once that is completed, the DMARC checks that the domain in SPF and/or DKIM check matches the sender’s domain in the From field and specifies how providers should deliver it if the message fails both SPF and DKIM – accept, reject, or mark it as spam. | Next, you’ll need to create a BIMI logo image. You should pay attention to how to format the file. The recommended size is a square. | After that, you should update your DNS with logo information. | Share | October 4, 2023 | January 22, 2023 | March 20, 2019"
        ]
    },
    {
        "Term": "Binary SMS message",
        "Link": "https://www.infobip.com/glossary/brand-indicators-for-message-identification-bimi",
        "Definition": "Brand Indicators for Message Identification (BIMI), is an email parameter that allows email inboxes to show a brand’s logo next to their email messages.",
        "null": [
            "What is Brand Indicators for Message Identification (BIMI)?"
        ]
    },
    {
        "Term": "Biometric authentication",
        "Link": "https://www.infobip.com/glossary/brand-indicators-for-message-identification-bimi",
        "Definition": "Brand Indicators for Message Identification (BIMI), is an email parameter that allows email inboxes to show a brand’s logo next to their email messages.",
        "null": [
            "What is Brand Indicators for Message Identification (BIMI)?"
        ]
    },
    {
        "Term": "Blocklist",
        "Link": "https://www.infobip.com/glossary/brand-indicators-for-message-identification-bimi",
        "Definition": "Brand Indicators for Message Identification (BIMI), is an email parameter that allows email inboxes to show a brand’s logo next to their email messages.",
        "null": [
            "What is Brand Indicators for Message Identification (BIMI)?"        ]
    },
    {
        "Term": "Business as a Service (BaaS)",
        "Link": "https://www.infobip.com/glossary/brand-indicators-for-message-identification-bimi",
        "Definition": "Brand Indicators for Message Identification (BIMI), is an email parameter that allows email inboxes to show a brand’s logo next to their email messages.",
        "null": [
            "What is Brand Indicators for Message Identification (BIMI)?"
                ]
    },
    {
        "Term": "Called ID",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Caller ID is a telecommunication service that enables users to identify incoming calls before answering. | Caller ID is possible with mobile, analog, digital, andVoIPcalls. | Depending on the device being used, Caller ID displays on the device screen as along numberwhen the call connects. Caller ID is also used for caller identification when receiving text messages. | Users can store numbers on their devices using either the SIM card or the storage device’s memory. Keeping the number allows users to save the number under a recognizable name for quick recognition. This name is then displayed every time the stored number calls. | Caller ID works in two steps. | The first step isphone number identification. The number shown is the caller’s registered phone number. Landlines and mobile phones use this protocol, while calls from VoIP can be modified (information can be changed). This step allows easier referencing of call back numbers. | Next isname identification, where the phone carrier of the receiving party identifies the caller’s name. This reference does not come from internal databases, as phone carriers use CNAMs to cross reference the phone number with the suitable contact’s name. | CNAM, orCallingNAMe, is an outside telecom service companies use to pair incoming numbers with names. CNAMs are not centralized databases. | Share | January 24, 2023 | January 18, 2023"
        ]
    },
    {
        "Term": "Carrier billing",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Causal AI",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "ChatGPT",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Click to open rate (CTOR)",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Click to WhatsApp",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Cloud contact center",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Communications Platform as a Service (CPaaS)",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Concatenated message",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Contact Center as a Service (CCaaS)",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Conversational commerce",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Conversational design",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Conversational experience",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Conversational marketing",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Conversational support",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Conversational UI",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "CPaaS X",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Customer satisfaction score (CSAT)",
        "Link": "https://www.infobip.com/glossary/caller-id",
        "Definition": "Caller ID is a telecommunication service that enables users to identify incoming calls before answering.",
        "null": [
            "What is a caller ID?"
        ]
    },
    {
        "Term": "Data coverage",
        "Link": "https://www.infobip.com/glossary/data-coverage",
        "Definition": "Data coverage refers to the location in which you can receive and transmit data from your mobile device.",
        "null": [
            "What is Data coverage?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Data coverage refers to the location in which you can receive and transmit data from your mobile device. | You will not be connected to the online world if you are in an area with no data coverage. This is important when tracking your IoT devices, for example. | You can receive calls andSMSmessages if you have amobile signal. But, for receivingWhatsApporMessengermessages or browsing the Internet, you need adata signal. | If you send a message and a person does not receive it because they do not have a data signal, thefallback optionensures SMS delivery by pushing SMS to Telecom Operators bypassing the servers. In that way, it is guaranteed that messages are not delayed e.g. because of server issues. | Share | December 20, 2024 | June 7, 2023 | June 7, 2023 | December 21, 2022"
        ]
    },
    {
        "Term": "Delivery reporting (DLR)",
        "Link": "https://www.infobip.com/glossary/data-coverage",
        "Definition": "Data coverage refers to the location in which you can receive and transmit data from your mobile device.",
        "null": [
            "What is Data coverage?"
        ]
    },
    {
        "Term": "DKIM",
        "Link": "https://www.infobip.com/glossary/data-coverage",
        "Definition": "Data coverage refers to the location in which you can receive and transmit data from your mobile device.",
        "null": [
            "What is Data coverage?"
        ]
    },
    {
        "Term": "DMARC",
        "Link": "https://www.infobip.com/glossary/data-coverage",
        "Definition": "Data coverage refers to the location in which you can receive and transmit data from your mobile device.",
        "null": [
            "What is Data coverage?"
        ]
    },
    {
        "Term": "Domain authentication",
        "Link": "https://www.infobip.com/glossary/data-coverage",
        "Definition": "Data coverage refers to the location in which you can receive and transmit data from your mobile device.",
        "null": [
            "What is Data coverage?"
        ]
    },
    {
        "Term": "DTMF code",
        "Link": "https://www.infobip.com/glossary/data-coverage",
        "Definition": "Data coverage refers to the location in which you can receive and transmit data from your mobile device.",
        "null": [
            "What is Data coverage?"
        ]
    },
    {
        "Term": "E.164",
        "Link": "https://www.infobip.com/glossary/e164",
        "Definition": "E.164 is an international standard public telecommunication numbering plan that defines the worldwide public switch telephone network and some data networks.",
        "null": [
            "What is E.164?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | E.164 is an international standard public telecommunication numbering plan that defines the worldwide public switch telephone network and some data networks. | In other words, it defines the general format for international telephone numbers. | Phone numbers that conform to e.164 are limited to 15 digits maximum, excluding country codes. Numbers displayed on recipient devices are usually prefixed with the “+” symbol to indicate that the number includes the country code. | Recipient network subscribers are able to determine this usually by looking at the NOA (nature of address) field of signaling messages. | Generally e.164 number format must only contain digits, spilt by country code (1 to 3 digits), followed by subscriber/recipient number (max 12 digits). | Share | January 18, 2023 | October 6, 2020"
        ]
    },
    {
        "Term": "Early media",
        "Link": "https://www.infobip.com/glossary/e164",
        "Definition": "E.164 is an international standard public telecommunication numbering plan that defines the worldwide public switch telephone network and some data networks.",
        "null": [
            "What is E.164?"
        ]
    },
    {
        "Term": "Email API",
        "Link": "https://www.infobip.com/glossary/e164",
        "Definition": "E.164 is an international standard public telecommunication numbering plan that defines the worldwide public switch telephone network and some data networks.",
        "null": [
            "What is E.164?"
        ]
    },
    {
        "Term": "Email automation",
        "Link": "https://www.infobip.com/glossary/e164",
        "Definition": "E.164 is an international standard public telecommunication numbering plan that defines the worldwide public switch telephone network and some data networks.",
        "null": [
            "What is E.164?"
        ]
    },
    {
        "Term": "Email bounce",
        "Link": "https://www.infobip.com/glossary/e164",
        "Definition": "E.164 is an international standard public telecommunication numbering plan that defines the worldwide public switch telephone network and some data networks.",
        "null": [
            "What is E.164?"
        ]
    },
    {
        "Term": "Facial recognition",
        "Link": "https://www.infobip.com/glossary/facial-recognition",
        "Definition": "Facial recognition is the power of AI which allows technology providers to authenticate end users by matching their human face to customer records.",
        "null": [
            "What is facial recognition?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Facial recognition is the power of AI which allows technology providers to authenticate end users by matching their human face to customer records. | Infobip biometrics uses facial recognition for3 factor authentication. | Share | No items found."
        ]
    },
    {
        "Term": "Failover",
        "Link": "https://www.infobip.com/glossary/facial-recognition",
        "Definition": "Facial recognition is the power of AI which allows technology providers to authenticate end users by matching their human face to customer records.",
        "null": [
            "What is facial recognition?"
        ]
    },
    {
        "Term": "Fallback option",
        "Link": "https://www.infobip.com/glossary/facial-recognition",
        "Definition": "Facial recognition is the power of AI which allows technology providers to authenticate end users by matching their human face to customer records.",
        "null": [
            "What is facial recognition?"
        ]
    },
    {
        "Term": "First call resolution (FCR)",
        "Link": "https://www.infobip.com/glossary/facial-recognition",
        "Definition": "Facial recognition is the power of AI which allows technology providers to authenticate end users by matching their human face to customer records.",
        "null": [
            "What is facial recognition?"
        ]
    },
    {
        "Term": "Fixed sender ID",
        "Link": "https://www.infobip.com/glossary/facial-recognition",
        "Definition": "Facial recognition is the power of AI which allows technology providers to authenticate end users by matching their human face to customer records.",
        "null": [
            "What is facial recognition?"
        ]
    },
    {
        "Term": "Flash SMS",
        "Link": "https://www.infobip.com/glossary/facial-recognition",
        "Definition": "Facial recognition is the power of AI which allows technology providers to authenticate end users by matching their human face to customer records.",
        "null": [
            "What is facial recognition?"
        ]
    },
    {
        "Term": "Geo redundancy",
        "Link": "https://www.infobip.com/glossary/geo-redundancy",
        "Definition": "Geo redundancy means placing physical servers in geographically diverse data centers to safeguard against catastrophic events and natural disasters and load balance traffic for optimal performance.",
        "null": [
            "What is Geo redundancy?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Geo redundancy means placing physical servers in geographically diverse data centers to safeguard against catastrophic events and natural disasters and load balance traffic for optimal performance. | Geo redundancy signifies a computer system operating at two or more geographical locations as a redundancy in case the primary system fails. | Geo redundancy duplicates IT infrastructure (servers and network resources) and stores them as a backup in two or more data centers in different regions. This makes the components simultaneously available, helps your organization’s resilience, and provides better protection. | Geo redundancy protects your data and minimizes downtime by replicating your organization’s data and IT infrastructure to other sites. This helps to ensure that applications and workloads remain available during an outage or disaster. | In a production use case, it provides help in minimizing network connectivity issues and downtime and ensures traffic is transferred to alternate nodes if one fails or needs to undergo routine maintenance. In a backup use case, geo redundancy enables the recovery of applications and workloads in case of an outage in your current location. | There are three types of Geo redundancy: | Redundancyimplies the presence of redundant backup servers that are on standby and ready to take over if the primary server fails.Failoveris the action of switching to a backup server or network in the case of failure. | Redundancyand backups are similar but different.Backupsare used for exact copies of data. They store and keep your business operational in case of data loss. While redundancy also does that but also ensures the continuity of network, applications, data, storage, power, etc., in the event of a disaster or data loss. | High availabilitymeans all systems and resources are always on and available. Whileredundancydoes not equal high availability, it ensures that additional resources are ready in case of system failure. | Share | February 6, 2023"
        ]
    },
    {
        "Term": "Global title (GT)",
        "Link": "https://www.infobip.com/glossary/geo-redundancy",
        "Definition": "Geo redundancy means placing physical servers in geographically diverse data centers to safeguard against catastrophic events and natural disasters and load balance traffic for optimal performance.",
        "null": [
            "What is Geo redundancy?"
        ]
    },
    {
        "Term": "GSM",
        "Link": "https://www.infobip.com/glossary/geo-redundancy",
        "Definition": "Geo redundancy means placing physical servers in geographically diverse data centers to safeguard against catastrophic events and natural disasters and load balance traffic for optimal performance.",
        "null": [
            "What is Geo redundancy?"
        ]
    },
    {
        "Term": "HAProxy",
        "Link": "https://www.infobip.com/glossary/haproxy",
        "Definition": "HAProxy or high availability proxy is a free and open source software which is most commonly used to improve the performance of a server environment by spreading requests to multiple servers and thus enhancing the speed and reliability of the server environment.",
        "null": [
            "What is HAProxy?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | HAProxy or high availability proxy is a free and open source software which is most commonly used to improve the performance of a server environment by spreading requests to multiple servers and thus enhancing the speed and reliability of the server environment. | The software can be run on Linux, Solaris and FreeBSD operating systems. | Share | May 11, 2023 | March 7, 2023"
        ]
    },
    {
        "Term": "Home location register (HLR)",
        "Link": "https://www.infobip.com/glossary/haproxy",
        "Definition": "HAProxy or high availability proxy is a free and open source software which is most commonly used to improve the performance of a server environment by spreading requests to multiple servers and thus enhancing the speed and reliability of the server environment.",
        "null": [
            "What is HAProxy?"
        ]
    },
    {
        "Term": "HTTP",
        "Link": "https://www.infobip.com/glossary/haproxy",
        "Definition": "HAProxy or high availability proxy is a free and open source software which is most commonly used to improve the performance of a server environment by spreading requests to multiple servers and thus enhancing the speed and reliability of the server environment.",
        "null": [
            "What is HAProxy?"
        ]
    },
    {
        "Term": "Human in the loop (HITL)",
        "Link": "https://www.infobip.com/glossary/haproxy",
        "Definition": "HAProxy or high availability proxy is a free and open source software which is most commonly used to improve the performance of a server environment by spreading requests to multiple servers and thus enhancing the speed and reliability of the server environment.",
        "null": [
            "What is HAProxy?"
        ]
    },
    {
        "Term": "Human takeover",
        "Link": "https://www.infobip.com/glossary/haproxy",
        "Definition": "HAProxy or high availability proxy is a free and open source software which is most commonly used to improve the performance of a server environment by spreading requests to multiple servers and thus enhancing the speed and reliability of the server environment.",
        "null": [
            "What is HAProxy?"
        ]
    },
    {
        "Term": "ICCID number",
        "Link": "https://www.infobip.com/glossary/iccid-number",
        "Definition": "The ICCID number stands for integrated circuit card ID. It is an 18 22 digit number typically printed on the back of a SIM card. No two SIM cards have the same ICCID number.",
        "null": [
            "What is an ICCID (Integrated Circuit Card Identification) number?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | TheIntegrated Circuit Card Identification number (ICCID)is an 18 22 digit number typically printed on the back of aSIM card. No two SIM cards have the same ICCID number. | The ICCID is a globally unique serial number – a one of a kind signature that identifies the SIM card itself. It is used in the Infobip IoT module and in reporting to identify IoT sims. | MNOsuse the ICCID to identify the correct network to connect your device, authenticate it, and ensure you get the right services. The ICCID helps MNOs and IoT service providers manage many connected devices. It makes it easy to identify, track, activate, and troubleshoot individual SIMs on a network. | The format for ICCID Number isMMCC IINN NNNN NNNN NN C x. | Integrated circuit card identifier serves several crucial purposes within cellular networks, especially forMobile Network Operators (MNOs)and IoT deployments. Here’s a breakdown of its primary functions: | People often use “SIM card number” in everyday conversation to refer to the ICCID. This is not technically incorrect; the integrated circuit card ID functions as the SIM card’s identifying number. | While the terms are often used interchangeably, sometimes understanding the difference can be helpful: | One ICCID per SIM: Each physical SIM card is manufactured with a single, permanent ICCID. This creates a one to one relationship between the physical SIM and its identifier. | This simple concept has well established processes for ICCID generation and management by MNOs. | Switching carriers requires getting a new SIM card with a new ICCID, which means less flexibility in managing multiple profiles or networks. | eSIMs allow users to switch between carriers or use various networks simultaneously (if the device supports it). This enhances roaming options and competition among MNOs. | eUICCIDis a unique identifier for the physical eSIM hardware. It’s analogous to the fixed ICCID on traditional SIM cards. | An eSIM is a chip soldered directly onto a device’s motherboard. It introduces a new identifier called the eUICCID, which identifies the physical eSIM hardware. | The relationship between physical hardware and ICCIDs becomes less straightforward. While there’s still a one to one relationship between a physical eSIM and its eUICCID, a single eSIM can now hold multiple ICCIDs. | eSIMs use the eUICC (Embedded Universal Integrated Circuit Card) software. The eUICC manages SIM profiles, and each profile can have its own unique ICCID. A single eSIM can hold multiple ICCIDs associated with different carriers or subscriptions. | Over the air (OTA)management allows MNOs to remotely change profiles and their associated ICCIDs on an eSIM without physically swapping cards. | TheInternational Mobile Subscriber Identity (IMSI)is a number that identifies your specific subscriber account and service plan. It’s like your cellular ‘profile.’ | For example, a SIM can store multiple IMSIs when roaming or with multi network SIMs. | When your device connects to a network: | In the world of IoT, both ICCID and IMSI are crucial: | The International Mobile Equipment Identity (IMEI)identifies the device, while ICCID identifies the SIM card. | The ICCID and the IMEI authenticate your device on the network, ensuring that both the SIM card and device are authorized. | In the case of a stolen device, the IMEI is the primary way for networks to block it from future use. The ICCID is used in tandem to ensure a stolen SIM isn’t used with a different device. | Since the ICCID number is used to manage SIM cards, locating it is crucial. It is usually on the card itself or printed on the packaging. Also, you can find the number when inserting a SIM card into a device and going to the settings menu (General > About). | For the IoT devices, you can create a query through an AT command based on the IoT mobile network module used in the device: | How do you find ICCID on an Android phone? | How to find ICCID on iPhone? | To find your ICCID on your iPhone, go to Settings > General > About > ICCID. | Can the ICCID be changed? | No. The ICCID is permanently assigned to a physical SIM card and can’t be altered. | Do I need to worry about ICCID security? | Be aware ofSIM swapfraud – scammers try to take over your number using your ICCID. | Choose a cellular provider with solid security measures to protect your ICCID. | Share | January 20, 2023 | January 18, 2023"
        ]
    },
    {
        "Term": "IMEI number",
        "Link": "https://www.infobip.com/glossary/iccid-number",
        "Definition": "The ICCID number stands for integrated circuit card ID. It is an 18 22 digit number typically printed on the back of a SIM card. No two SIM cards have the same ICCID number.",
        "null": [
            "What is an ICCID (Integrated Circuit Card Identification) number?"
        ]
    },
    {
        "Term": "IMSI",
        "Link": "https://www.infobip.com/glossary/iccid-number",
        "Definition": "The ICCID number stands for integrated circuit card ID. It is an 18 22 digit number typically printed on the back of a SIM card. No two SIM cards have the same ICCID number.",
        "null": [
            "What is an ICCID (Integrated Circuit Card Identification) number?"
        ]
    },
    {
        "Term": "In app notification",
        "Link": "https://www.infobip.com/glossary/iccid-number",
        "Definition": "The ICCID number stands for integrated circuit card ID. It is an 18 22 digit number typically printed on the back of a SIM card. No two SIM cards have the same ICCID number.",
        "null": [
            "What is an ICCID (Integrated Circuit Card Identification) number?"
        ]
    },
    {
        "Term": "Inbound message",
        "Link": "https://www.infobip.com/glossary/iccid-number",
        "Definition": "The ICCID number stands for integrated circuit card ID. It is an 18 22 digit number typically printed on the back of a SIM card. No two SIM cards have the same ICCID number.",
        "null": [
            "What is an ICCID (Integrated Circuit Card Identification) number?"
        ]
    },
    {
        "Term": "Independent software vendor (ISV)",
        "Link": "https://www.infobip.com/glossary/iccid-number",
        "Definition": "The ICCID number stands for integrated circuit card ID. It is an 18 22 digit number typically printed on the back of a SIM card. No two SIM cards have the same ICCID number.",
        "null": [
            "What is an ICCID (Integrated Circuit Card Identification) number?"
        ]
    },
    {
        "Term": "Intelligent routing (IR)",
        "Link": "https://www.infobip.com/glossary/iccid-number",
        "Definition": "The ICCID number stands for integrated circuit card ID. It is an 18 22 digit number typically printed on the back of a SIM card. No two SIM cards have the same ICCID number.",
        "null": [
            "What is an ICCID (Integrated Circuit Card Identification) number?"
        ]
    },
    {
        "Term": "Intent",
        "Link": "https://www.infobip.com/glossary/iccid-number",
        "Definition": "The ICCID number stands for integrated circuit card ID. It is an 18 22 digit number typically printed on the back of a SIM card. No two SIM cards have the same ICCID number.",
        "null": [
            "What is an ICCID (Integrated Circuit Card Identification) number?"
        ]
    },
    {
        "Term": "Interactive voice response (IVR)",
        "Link": "https://www.infobip.com/glossary/iccid-number",
        "Definition": "The ICCID number stands for integrated circuit card ID. It is an 18 22 digit number typically printed on the back of a SIM card. No two SIM cards have the same ICCID number.",
        "null": [
            "What is an ICCID (Integrated Circuit Card Identification) number?"
        ]
    },
    {
        "Term": "iOS",
        "Link": "https://www.infobip.com/glossary/iccid-number",
        "Definition": "The ICCID number stands for integrated circuit card ID. It is an 18 22 digit number typically printed on the back of a SIM card. No two SIM cards have the same ICCID number.",
        "null": [
            "What is an ICCID (Integrated Circuit Card Identification) number?"
        ]
    },
    {
        "Term": "ISO 9001",
        "Link": "https://www.infobip.com/glossary/iccid-number",
        "Definition": "The ICCID number stands for integrated circuit card ID. It is an 18 22 digit number typically printed on the back of a SIM card. No two SIM cards have the same ICCID number.",
        "null": [
            "What is an ICCID (Integrated Circuit Card Identification) number?"
        ]
    },
    {
        "Term": "ISO 27001",
        "Link": "https://www.infobip.com/glossary/iccid-number",
        "Definition": "The ICCID number stands for integrated circuit card ID. It is an 18 22 digit number typically printed on the back of a SIM card. No two SIM cards have the same ICCID number.",
        "null": [
            "What is an ICCID (Integrated Circuit Card Identification) number?"
        ]
    },
    {
        "Term": "Keyword chatbot",
        "Link": "https://www.infobip.com/glossary/keyword-chatbot",
        "Definition": "Keyword chatbots – also known as “rule based chatbots” or “flow based chatbots” – analyze users’ text input based on keywords and give the appropriate response.",
        "null": [
            "What is a Keyword chatbot?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Keyword chatbots – also known as “rule based chatbots” or “flow based chatbots” – analyze users’ text input based on keywords and give the appropriate response. | Keyword chatbots help with simple customer service queries and frequently asked questions (FAQs). | Powered by pre defined rules or decision flows, keyword chatbots are programmed to assist with a series of options. The user selects the option that fits their need and then enters the relevant keyword to progress their query. | Unlike AI chatbots, keyword chatbots don’t use any artificial intelligence (AI) but progress users through the decision flow by inviting them to select from option lists or use specific keywords. | The main difference betweenrule based keyword chatbotsandintent basedAI chatbotsis how customers interact with the program. | A keyword chatbot provides options that users can choose from to select the best fit for their query. On the other hand, AI chatbots enable more conversational interactions by interpreting the user’s intent based on the language used. The artificial intelligence (AI) andnatural language processing(NLP) behind these chatbots provide a superior customer experience that’s much closer to the experience of chatting with another human. | Share | February 6, 2023"
        ]
    },
    {
        "Term": "Large action model (LAM)",
        "Link": "https://www.infobip.com/glossary/lam-large-action-model",
        "Definition": "Large Action Models (LAMs) are AI models designed to take action by translating human intentions within a given environment or system.",
        "null": [
            "What is Large Action Model (LAM)?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Large Action Models (LAMs)are AI models designed to take action by translating human intentions within a given environment or system. | Think of it like this: | Generative AIprovides the building blocks for LAMs to understand, reason, and act in the world. It’s a core component that enables LAMs to go beyond passive language processing and become active problem solvers. | The term LAM is sometimes used interchangeably with AI agent. AI agents are software programs that can perceive their environment, make decisions, and take actions to achieve specific goals. LAMs can be seen as a type of AI agent that useslarge language models (LLMs)for advanced language understanding and action planning. | 1. Foundation layer:LAMs often begin by integrating a powerful existing large language model. This LLM is fine tuned with specific data to prepare it for the LAM’s unique purpose. This foundation allows the LAM to understand natural language and figure out what the user wants. | 2. Multimodal input processing:LAMs can handle more than just text. They can also process images and potentially even user interactions. Special techniques are used to analyze text and extract key information. | 3. Goal inference:The LAM analyzes the user’s request, considering things like their past behavior and what’s happening in the application they’re using. This helps the LAM understand the user’s true goal, which might be more than what they literally said. | 4. Understand the user interface:LAMs use computer vision to interpret visual information from application interfaces. They can recognize things like buttons and menus and understand how these elements work within the application. | 5. Breaks down tasks and plans actions:Once the LAM understands the goal, it breaks it down into smaller, actionable subtasks. It then creates a plan, prioritizing actions based on efficiency, user preferences, and learned rules of thumb. | 6. Decision making and reasoning:LAMs use advanced algorithms that combine neural networks and symbolic AI techniques for decision making. This allows them to use pattern recognition and logical reasoning to determine the best action. | 7. Execute tasks:LAMs interact with external systems using tools like web automation frameworks. They can simulate user actions like clicking, typing, or navigating between pages. Some LAMs can also directly interact with other software systems. | 8. Continuously learning and human oversight:LAMs use variousmachine learningtechniques to improve with each interaction. Many LAMs also allow for human oversight, enabling intervention in complex scenarios. | LAMs have the potential to automate a wide range of tasks, including: | LAMs often have LLMs at their core. LLMs excel at understanding and generating human like text. This allows LAMs to: | Even with all the similarities and overlaps between the concepts of LAM and LLM, here’s a more in depth look at their key differences: | LAMs have potential applications across various industries, including: | What are the ethical considerations surrounding LAMs? | It’s important to address ethical considerations like potential bias in decision making, the impact on employment, and the responsible use of LAMs in sensitive areas like healthcare and finance. | What is the future of LAMs? | As LAMs continue to evolve, we can expect to see them become more sophisticated, capable, and integrated into various aspects of our lives. They hold the potential to transform how we interact with technology and automate complex tasks, leading to increased efficiency and productivity. | Level up your AI and machine learning knowledge in 2025 with our curated list of the best free courses and resources available on the web. | As the buzz around GenAI starts to fizzle, has it lived up to our high expectations, and what does the future look like for GenAI? | Find out how humans play a critical role in successful AI systems and the ways AI can complement human work, instead of replace it. | Share"
        ]
    },
    {
        "Term": "Large language model (LLM)",
        "Link": "https://www.infobip.com/glossary/lam-large-action-model",
        "Definition": "Large Action Models (LAMs) are AI models designed to take action by translating human intentions within a given environment or system.",
        "null": [
            "What is Large Action Model (LAM)?"
        ]
    },
    {
        "Term": "LLM orchestration",
        "Link": "https://www.infobip.com/glossary/lam-large-action-model",
        "Definition": "Large Action Models (LAMs) are AI models designed to take action by translating human intentions within a given environment or system.",
        "null": [
            "What is Large Action Model (LAM)?"
        ]
    },
    {
        "Term": "Local time stamp",
        "Link": "https://www.infobip.com/glossary/lam-large-action-model",
        "Definition": "Large Action Models (LAMs) are AI models designed to take action by translating human intentions within a given environment or system.",
        "null": [
            "What is Large Action Model (LAM)?"
        ]
    },
    {
        "Term": "Machine to machine communication",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Machine to machine (M2M) communicationis the direct data transfer and information between devices without explicit human intervention. | Devices in an M2M system use sensors, embedded processors, and communication technologies to gather data, send it across a network (wired or wireless technology), and trigger actions or responses on other machines. | The value of M2M lies in gathering data, deriving insights, and automating actions that improve efficiency, reduce costs, and enhance decision making. | M2M systems rely on machines or devices equipped with sensors capable of collecting various data types. These sensors can measure things like: | The devices need a way to transmit the collected data. This is achieved through a network, which could be: | The transmitted data arrives at a central software platform or application. This software does the following: | Imagine a machine on a factory floor equipped with temperature and vibration sensors.If the software detects the machine overheating or unusual vibrations, it might send a maintenance alert to technicians or even preemptively shut down the machine to prevent damage. | The most common examples of M2M technology are: | M2M communication focuses on direct communication between devices, minimizing the need for manual intervention. | Machine to machine systems rely heavily on sensors to gather data about the environment, machine status, inventory levels, etc. | M2M connections utilize various networks to transmit data, including cellular, WiFi, and specialized low power networks (e.g., LoRaWAN, Sigfox). | M2M devices are often deployed in remote locations and need to operate for extended periods. Therefore, they’re designed to conserve power. | Machine to machine communications typically involve transferring relatively small amounts of data regularly (i.e., sensor readings and status updates). | M2M systems often operate in mission critical applications, so the connections and underlying networks must be highly reliable. | Due to the sensitivity of the data often transmitted, machine to machine connections prioritize security features to prevent unauthorized access or interception. | M2M enables remote monitoring of devices and assets, even in hard to reach locations. It also allows for remote control or configuration changes. | Think of machine to machine communication as a building block within the larger IoT ecosystem.M2M provides the core capability for devices to communicate. IoT expands on that by enabling wider connectivity, intelligent data analysis, and the creation of innovative services and applications across many sectors. | Here’s a breakdown of the key differences between the two: | IoT:The IoT is a broader concept encompassing a vast network of interconnected things, including consumer devices, industrial equipment, wearables, vehicles, and more. It focuses on the power of widespread connectivity and data sharing at a large scale. | M2M:Machine to machine focuses on direct communication between machines, often within specific industries or applications. It’s a foundational component of the IoT. | IoT:IoT systems often involve more complex architectures with multiple layers of devices, networks, cloud platforms, and data analytics. They can handle larger amounts of data and provide insights across various domains. | M2M:M2M systems tend to be more focused and streamlined, with a specific communication path between machines. | IoT:IoT emphasizes the ability of diverse devices and systems to communicate and exchange information seamlessly. It promotes open standards and protocols. | M2M:While interoperability is important within machine to machine systems, it may be limited to specific devices or standards within a particular application. | IoT:The IoT enables a wide range of applications, including smart homes, smart cities, connected healthcare, intelligent logistics, and complex industrial automation. | M2M:M2M is traditionally used in remote asset monitoring, fleet management, industrial automation, and point of sale systems applications. | Machine to machine communication presents unique security challenges and requires careful consideration. | M2M systems often control critical infrastructure or handle sensitive data (e.g., healthcare, energy grids, industrial processes). A security breach could have serious consequences, including financial losses, operational disruptions, or safety hazards. | M2M devices are often deployed in remote or unattended locations, making them harder to secure and monitor physically. | The diversity of devices, communication protocols, and networks in machine to machine systems increases the number of potential attack points. | Many M2M devices have limited computational power and memory, making it harder to implement robust security measures. | Simple passwords or lack of authentication leave devices vulnerable to unauthorized access. | Data transmitted in cleartext can be easily intercepted, especially over wireless networks. | Outdated firmware or software bugs provide openings for attackers to exploit. | Devices’ inaccessible locations may be susceptible to physical tampering, allowing attackers to extract data or install malware. | M2M devices and networks can be targeted to overwhelm them with traffic, making them inaccessible to legitimate users. | Encrypt data both in transit and at rest to protect it from eavesdropping and unauthorized access. | Implement robust authentication mechanisms like multi factor authentication or certificate based authentication. | Keep device firmware and software up to date to patch vulnerabilities. | Separate machine to machine networks from other IT networks to reduce the attack surface. | Implement monitoring systems to detect and respond to suspicious activities. | Where possible, secure M2M devices in tamper resistant enclosures and restrict physical access. | Ensure secure onboarding of new devices with unique identities and trusted credentials. | What industries are the biggest users of M2M technology? | The most significant users of machine to machine technology are manufacturing, healthcare, logistics, smart cities, and utilities. | What are the typical costs involved in M2M? | Typical M2M costs include hardware, network connectivity fees, software development/licensing, and ongoing maintenance. | March 28, 2024 | March 22, 2024 | March 13, 2024 | Share"
        ]
    },
    {
        "Term": "Machine learning (ML)",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "Magic links",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "Media message template",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "MMS",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "Mobile data penetration",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "Mobile identity",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "Mobile network operator (MNO)",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "Mobile number portability (MNP)",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "Mobile originated (MO)",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "Mobile phone penetration",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "Mobile terminated (MT)",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "MSIN",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "MSISDN",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "Multifactor authentication (MFA)",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "Multimedia message service",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "Multimodal AI",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
        ]
    },
    {
        "Term": "MVNO",
        "Link": "https://www.infobip.com/glossary/machine-to-machine-communication",
        "Definition": "Machine to machine (M2M) communication is the direct data transfer and information between devices without explicit human intervention.",
        "null": [
            "What is machine to machine communication (M2M)?"
                ]
    },
    {
        "Term": "Named entity recognition (NER)",
        "Link": "https://www.infobip.com/glossary/ner",
        "Definition": "Named entity recognition (NER) is used in AI chatbots to identify and classify a user’s words into predefined categories.",
        "null": [
            "What is NER (named entity recognition)?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Named entity recognition (NER) is used in AI chatbots to identify and classify a user’s words into predefined categories. | NERis a subtask of natural language processing (NLP); NER seeks to locate and classify the words used by a user into predefined categories, such as a person’s name, location, organization, contact details, and so on. This information can then be carried onto downstream tasks, deeper into the chatbot’s conditional decision flow.NLPfocuses on analyzing and processing natural language. | Head to ourdocumentation pageto learn how NER enabled intents work in our chatbot building platform, Answers. | Share | May 11, 2023 | February 6, 2023"
        ]
    },
    {
        "Term": "Natural language processing (NLP)",
        "Link": "https://www.infobip.com/glossary/ner",
        "Definition": "Named entity recognition (NER) is used in AI chatbots to identify and classify a user’s words into predefined categories.",
        "null": [
            "What is NER (named entity recognition)?"
        ]
    },
    {
        "Term": "Natural language understanding (NLU)",
        "Link": "https://www.infobip.com/glossary/ner",
        "Definition": "Named entity recognition (NER) is used in AI chatbots to identify and classify a user’s words into predefined categories.",
        "null": [
            "What is NER (named entity recognition)?"
        ]
    },
    {
        "Term": "Numeric sender ID",
        "Link": "https://www.infobip.com/glossary/ner",
        "Definition": "Named entity recognition (NER) is used in AI chatbots to identify and classify a user’s words into predefined categories.",
        "null": [
            "What is NER (named entity recognition)?"
        ]
    },
    {
        "Term": "One time PIN code (OTP)",
        "Link": "https://www.infobip.com/glossary/otp-one-time-pin-code",
        "Definition": "A one time PIN code is a code that is automatically generated and sent, usually to a mobile device, to allow a single login session or transaction.",
        "null": [
            "What is a One time PIN code (OTP code)?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Aone time PIN codeis a code that is automatically generated and sent, usually to a mobile device, to allow a single login session or transaction. | Also called aone time pass codeis a key component of2 Factor Authentication (2FA)solutions that are used by most financial service providers to provide the highest level of security to customer transactions. | The idea is that the PIN is valid for only one use or for a short period, making it more difficult for unauthorized individuals to gain access to an account or system. | They are popular with users as they are quick and easy to use, and popular with businesses as they are a very cost effective way of securing transactions and avoiding costly fraud incidents. | Here’s how it typically works: | The generation of one time PIN codes relies on the authentication server and user device having access to the same secure ‘knowledge’. | There are two types of code: | The most common way ofdelivering a one time PIN code is via SMSto a mobile phone. All mobile phones can receive SMS, there is no requirement for data or an internet connection, and the fact that mobile phones usually require their own code to unlock adds even more security. | They can also be delivered through proprietary tokens, though these are less popular as they require a person to carry the token at all times. | What makes one time PIN codes so secure is that they can only be used once, and can be set to expire after a short period of time. Even though normal passwords can be very complex, they are usually only changed every few months, or sometimes never. This makes them far more susceptible to hackers and data breaches. | In the most secure solutions, one time passcodes and passwords are used together to provide the highest protection from fraud. | Using a one time password as an additional layer of authentication method provides several benefits including: | One time passwords can be generated or delivered through various methods. Here are a few examples: | They are often used in online banking for transaction verification and login authentication. | Users receive OTPs via SMS, email, or mobile apps to confirm financial transactions or log in to their accounts securely. | During online purchases or transactions, they can be used to confirm the legitimacy of the user. | This adds an extra layer of security to prevent unauthorized transactions. | One time PIN codes are used for identity verification in various online services, ensuring that the person attempting access is the legitimate account holder. | This is particularly crucial in scenarios where personal information or sensitive data is involved. | They are sometimes used in the password recovery process. | Users receive a one time PIN to verify their identity before resetting a forgotten password. | In healthcare systems, they can be employed to secure access to patient records or other sensitive healthcare data. | This helps maintain the confidentiality and integrity of healthcare information. | Your customers’ security should be one of your highest priorities. Learn about 2FA and how it can help you protect your customers. | Risk based authentication (RBA) dynamically assesses the risk level of each login attempt or transaction based on the risk and context. | Learn about the latest SMS fraud tactics criminals are using, how they work, and how they can be prevented. | Share"
        ]
    },
    {
        "Term": "OpenAI",
        "Link": "https://www.infobip.com/glossary/otp-one-time-pin-code",
        "Definition": "A one time PIN code is a code that is automatically generated and sent, usually to a mobile device, to allow a single login session or transaction.",
        "null": [
            "What is a One time PIN code (OTP code)?"
        ]
    },
    {
        "Term": "Opt in",
        "Link": "https://www.infobip.com/glossary/otp-one-time-pin-code",
        "Definition": "A one time PIN code is a code that is automatically generated and sent, usually to a mobile device, to allow a single login session or transaction.",
        "null": [
            "What is a One time PIN code (OTP code)?"
        ]
    },
    {
        "Term": "Opt out",
        "Link": "https://www.infobip.com/glossary/otp-one-time-pin-code",
        "Definition": "A one time PIN code is a code that is automatically generated and sent, usually to a mobile device, to allow a single login session or transaction.",
        "null": [
            "What is a One time PIN code (OTP code)?"
        ]
    },
    {
        "Term": "OTA",
        "Link": "https://www.infobip.com/glossary/otp-one-time-pin-code",
        "Definition": "A one time PIN code is a code that is automatically generated and sent, usually to a mobile device, to allow a single login session or transaction.",
        "null": [
            "What is a One time PIN code (OTP code)?"
        ]
    },
    {
        "Term": "Outbound message",
        "Link": "https://www.infobip.com/glossary/otp-one-time-pin-code",
        "Definition": "A one time PIN code is a code that is automatically generated and sent, usually to a mobile device, to allow a single login session or transaction.",
        "null": [
            "What is a One time PIN code (OTP code)?"
        ]
    },
    {
        "Term": "Over the top apps (OTTs)",
        "Link": "https://www.infobip.com/glossary/otp-one-time-pin-code",
        "Definition": "A one time PIN code is a code that is automatically generated and sent, usually to a mobile device, to allow a single login session or transaction.",
        "null": [
            "What is a One time PIN code (OTP code)?"
        ]
    },
    {
        "Term": "Password hashing",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Password hashingis a process that transforms your password into a jumbled, unrecognizable string of characters (the “hash”). This hash is what gets stored in a website’s database. Even if a hacker were to steal that database, they wouldn’t see your actual password. | Use this analogy: your password is a secret ingredient in a recipe. You wouldn’t write that ingredient down in plain English in your cookbook, right? The same goes for passwords. | Here’s how password hashing is used to grant access while keeping your password secure: | No plain text: Your real password is never stored, so even if a hacker gains access to the database, they won’t find passwords in a readable form. | Let’s say your password is “P@ssw0rd123”. A hashing algorithm might turn it into something like “a94a8fe5ccb19ba61c4c0873d391e987982fbbd3”. This hash is what gets stored. When you log in and re enter “P@ssw0rd123”, the system re hashes it and sees that it matches the stored hash, allowing you in. | Password salting is a security technique used to make password hashes even more resistant to cracking. | Let’s say your password is “password123.” | Even if someone else has the same “password123,” their salt will differ, resulting in a unique hash. | Salted passwords should be stored in a secure database alongside their corresponding salts. | While hash functions are a powerful tool in cryptography and security, they have some inherent limitations that are important to be aware of: | Hashing is used to verify that data hasn’t been altered and to store passwords securely. Encryption is used to keep data private during transmission or storage. While both are important security tools, they serve different purposes and shouldn’t be confused or used interchangeably. | Hashing is an essential tool for password security, but it’s most effective when used with other security measures. Using a multi layered approach, website owners can significantly reduce the risk of password compromise and protect their users’ sensitive information. | Ensuring secure password security involves a combination of user best practices and sound system level implementations. | Users should prioritize creating strong, unique passwords at least 12 characters long and include a mix of uppercase and lowercase letters, numbers, and symbols. Avoiding personal information and utilizing password managers can further bolster security. Enablingtwo factor authentication (2FA)provides extra protection against unauthorized access. | Can a hashed password be decrypted to get the original password? | No, hashing is a one way function. It’s designed to be irreversible, so it’s practically impossible to recover the original password from a hash. This is why it’s important to choose a strong hashing algorithm and salt passwords. | Can I use hashing to protect other types of sensitive data besides passwords? | Yes, hashing can be used to protect various types of data, such as credit card numbers, social security numbers, or any other information you want to keep confidential. However, for data that needs to be retrievable in its original form, encryption is a more appropriate solution. | Is hashing enough to protect my passwords from all attacks? | While hashing is a crucial security measure, it’s not foolproof. Other security practices, such as strong password policies, two factor authentication, and regular security audits, are also essential to ensure comprehensive password protection. | Zero trust security assumes no user, device, or network traffic should be trusted by default, even within the organization’s network. | Risk based authentication (RBA) dynamically assesses the risk level of each login attempt or transaction based on the risk and context. | Passwordless authentication is a way to identify your identity without using a password. Instead, it uses more secure alternatives like possession factors or biometrics. | Discover the challenges and solutions for secure conversational banking. Get expert insights from Stephen Gilmore, owner of Status Data. | Help your users avoid the heartache of romance scams by keeping them safe with Mobile Identity. | Biometric authentication performs identification and authentication based on recognizable and verifiable data that is unique and specific to that person. | Generative AI is here and we marvel at its astounding powers. But, can these powers be used for more nefarious purposes? Read to find out more! | Share"
        ]
    },
    {
        "Term": "Passwordless authentication",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?"
        ]
    },
    {
        "Term": "Payments for WhatsApp",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?"
        ]
    },
    {
        "Term": "PCI DSS",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?"
        ]
    },
    {
        "Term": "Pentesting",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?"
        ]
    },
    {
        "Term": "Person to application messaging (P2A)",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?"
        ]
    },
    {
        "Term": "Person to person messaging (P2P)",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?"
        ]
    },
    {
        "Term": "Personal data verification",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?"
        ]
    },
    {
        "Term": "Pig butchering scam",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?"
        ]
    },
    {
        "Term": "Platform company",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?"
        ]
    },
    {
        "Term": "Premium SMS number",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?"
        ]
    },
    {
        "Term": "PSTN",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?"
        ]
    },
    {
        "Term": "Push notifications",
        "Link": "https://www.infobip.com/glossary/password-hashing",
        "Definition": "Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the \"hash\").",
        "null": [
            "What is password hashing?"
        ]
    },
    {
        "Term": "Quantum AI",
        "Link": "https://www.infobip.com/glossary/quantum-ai",
        "Definition": "Quantum artificial intelligence (QAI) is an emerging field that combines the principles of quantum mechanics with artificial intelligence.",
        "null": [
            "What is Quantum AI?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Quantum artificial intelligence(QuantumAI,QAI)is an emerging field that combines the principles of quantum mechanics with artificial intelligence. It aims to develop new algorithms and models that can leverage the unique properties of quantum computers. | AI has made significant progress but is still limited. Quantum computing can help AI overcome these obstacles and achieveartificial general intelligence (AGI). | Quantum computers can speed up the training of AI models and improve their algorithms, allowing them to analyze vast amounts of data in a short time. This could lead to significant technological advancements. | Quantum AI is a promising solution to current challenges in AI development, such as creating more adaptable learning models and improving reasoning abilities. It could be a key driver in developing the next generation of AI. | Quantum AI researchers are developing quantum algorithms formachine learningtasks like classification, clustering, and regression. These algorithms can potentially revolutionize fields like drug discovery, material science, and finance. | Here are a few real world examples and potential applications: | While quantum computers could potentially break current encryption, they also offer a solution through quantum resistant cryptography. Companies likeArqitare already developing quantum encryption to protect our data. Integrating AI further strengthens these security systems. | Machine learning algorithms powered by Quantum AI are crucial for detecting cyber threats in real time. They can analyze vast amounts of data to identify patterns and anomalies that traditional methods might miss. Quantum AI’s speed allows us to stay ahead of cybercriminals and proactively protect our digital landscape. | How is Quantum AI different from traditional AI? | Traditional AI runs on classical computers, which use bits to represent information as either 0 or 1.Quantum AI, on the other hand, leverages quantum computers, which use qubits (quantum bits). Qubits can exist in multiple states simultaneously, enabling them to perform parallel computations and potentially solve problems exponentially faster than classical computers. | May 1, 2024 | March 28, 2024 | January 24, 2024 | Share"
        ]
    },
    {
        "Term": "Quishing",
        "Link": "https://www.infobip.com/glossary/quantum-ai",
        "Definition": "Quantum artificial intelligence (QAI) is an emerging field that combines the principles of quantum mechanics with artificial intelligence.",
        "null": [
            "What is Quantum AI?"
        ]
    },
    {
        "Term": "RCS",
        "Link": "https://www.infobip.com/glossary/rcs-rich-communication-services",
        "Definition": "RCS is an IP based messaging service provided to mobile phone users through mobile operator networks.",
        "null": [
            "What is RCS Messaging?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Rich Communication Services (RCS)is the next generation of text messaging, designed to replace the limitations of SMS and MMS with a richer, more engaging experience. | Think of it as elevating your phone’s default messaging app to the level of popular chat apps likeWhatsApp,Viber, or iMessage. RCS is used forperson to person(P2P) andapplication to person(A2P) communications. | RCS messaging might also be referred to as: | Thirty years ago,SMSreformed communication, allowing us to send short text messages instantly across the globe. It was a groundbreaking innovation that changed how we connect. But technology, like time, marches on. User expectations have matured, demanding richer, more dynamic ways to interact. | While SMS and its multimedia counterpart, MMS, were pioneers, they now face limitations in a world accustomed to feature rich messaging apps. | SMS (Short Message Service):Confined to 160 characters, SMS struggles to convey complex information or express emotions effectively. | MMS (Multimedia Messaging Service):Although MMS allows for sharing images and videos, it’s often hampered by low resolution and file size restrictions, hindering its ability to deliver truly engaging content. | Rich Communication Servicesemerged to bridge this gap and modernize mobile messaging, offering a more versatile and feature rich experience. | RCS aims to be the future of mobile messaging by offering: | RCS is based on Universal Profile, a set of standards developed by the GSMA to ensure interoperability between different carriers and devices. It relies on IP based technology, similar to chat apps, but is delivered through mobile network operators. | Widespread adoption of Rich Communication Services depends on the support of both carriers and device manufacturers. Carriers play a crucial role in enabling RCS on their networks, while device manufacturers need to ensure their phones are compatible with the Universal Profile. | The good news is that RCS is gaining significant momentum. It is now availableworldwidethrough the majority of service providers and devices, including Apple. This widespread adoption is a major step towards making RCS the new global standard for mobile messaging. | Apple released iOS 18 and now supports RCS on their devices. | October 29, 2024 | Before we discuss the differences between the three messaging services, it might be helpful to understand thedifferences between MMS (Multimedia Messaging Service) and SMS (Short Message Service). | Thirty years ago, when the first text message was sent, it changed how we communicate.SMSdoesn’t require an Internet connection; all you need is a cell signal. However, it cannot send images, videos, GIFs, or other multimedia content and hasa limit of 160characters. It is reliable and excellent for sending notifications, reminders, andOTPs. | MMSis considered the next generation of SMS. It allows sharing of multimedia documents, images, or videos and is often used to send coupons, discounts, and proof of delivery. | Rich Communication Services is a powerful messaging channel as it combines the global reach of SMS and MMS with the rich features of chat apps (such asWhatsApp,Viber, andFacebook Messenger) to deliver more interactive, compelling user experiences. | October 16, 2024 | WhileOTT appshave gained immense popularity, they require users to download and install a separate application. RCS, on the other hand, leverages the existing infrastructure of mobile operators and is integrated directly into the phone’s default messaging app. | This gives it a broader reach and eliminates the need for users to adopt a new platform. | July 25, 2024 | May 22, 2024 | April 26, 2024 | RCS Business Messaging (RBM)takes RCS’s capabilities and puts them to work for businesses. It allows companies to communicate with customers through their native messaging app, using rich media, interactive elements, and branding features to create more engaging and effective interactions. | RBM transforms customer interactions by enabling businesses to: | September 19, 2024 | RCS Business Messaging is being adopted across various industries to improve customer communication and drive business outcomes. Here are some examples: | 93% | 93%delivery rate | 60% | 60%seen rate | 90% | 90%secure delivery rate | 75% | 75%ROI on RCS Business Messages | 31% | 31%delivery rate for RCS Business Messages | 2x | 2xincrease in conversion | 8% | 8%surge in click through rates | 133% | 133%rise in engagement | With growing support from carriers, device manufacturers, and businesses, Rich Communication Services is poised to become the new standard for mobile messaging. | Its ability to combine the reach of SMS with the richness of chat apps makes it an attractive solution for both consumers and businesses. | The stats speak for itself: | Forcast of active RCS users by 2027 | Operator billed RCS revenue by 2028 | Source:Juniper Research | However, there are some hurdles to overcome: | Challenge: Many people are still unaware of RCS and its benefits compared to traditional SMS or OTT apps. | Overcoming this: Increased marketing and education efforts are needed to raise consumer awareness about RCS and its advantages. Device manufacturers and carriers can play a key role in promoting RCS to their users. | Challenge: As RCS relies on mobile operators, user data is subject to carrier privacy policies. | Overcoming this: Businesses using RCS need to be transparent about how they collect and use customer data to comply with privacy regulations. | Challenge: While many carriers support RCS, there can be inconsistencies in implementation and interoperability between different networks. This fragmentation can create a less seamless experience for users and hinder the full potential of RCS. | Overcoming this: Increased collaboration and standardization efforts among carriers are needed to ensure a consistent and interoperable RCS experience across different networks. | Challenge: RCS faces stiff competition from established OTT messaging apps like WhatsApp, Facebook Messenger, and iMessage. These apps have large user bases and offer similar features to RCS. | Overcoming this: RCS needs to differentiate itself by highlighting its unique advantages, such as its universal reach, integration with native messaging apps, and potential for enhanced business communication. | Despite these challenges, the future of RCS remains promising. Rich Communication Services is not just about enhanced messaging – it’s a platform for innovation. As technology advances, we can anticipate even more transformative applications of RCS for businesses, such as: | AI is poised to transform RCS by powering intelligent chatbots, personalizing user experiences, and enabling predictive analytics. | While RCS brings rich, interactive messaging to the forefront, 5G provides the robust infrastructure needed to unleash its full potential. | [Juniper Research Leaderboard 2024] | 1. How do I know if I’m talking to someone with RCS? | To check if you have enabled (or disabled) RCS: | RCS messages you’ve sent are darker blue than SMS or MMS messages. | 2. How to enable RCS on Android device? | If your carrier supports RCS but your device isn’t automatically set up for RCS chats, you may get a notification to “Do more with Google Messages.” If you get this notification: | 3. How do I know if my message was sent? | Google Messages tells you when your message has been sent, received, and read through the icons next to your message. | Important: These icons won’t show on SMS or MMS messages. | Share | Read some of our latest blog posts | Explore how RCS is the next big messaging evolution in the US, combining SMS, MMS, and iMessage into one powerful channel and reshaping how businesses communicate with their customers. | July 22, 2024 | Dive into the world of RCS and conversational messaging in this exclusive interview with BT. Learn how our partnership is shaping the future of customer engagement. | July 5, 2024 | Deep dive into the world of banking via RCS Business Messaging and learn about the benefits, use cases, and how to get started. | July 1, 2024 | Find out how building chatbots for the RCS channel that are powered by Google’s Vertex AI can deliver some exceptional use cases. | June 17, 2024 | Find out the best ways to offer a secure customer journey for on demand ride sharing and food delivery services. | March 11, 2024 | Learn how rich channels such as RCS Business Messaging enable businesses to bring conversational commerce to life. | May 26, 2023"
        ]
    },
    {
        "Term": "Regular expression (Regex)",
        "Link": "https://www.infobip.com/glossary/rcs-rich-communication-services",
        "Definition": "RCS is an IP based messaging service provided to mobile phone users through mobile operator networks.",
        "null": [
            "What is RCS Messaging?"
        ]
    },
    {
        "Term": "Retry",
        "Link": "https://www.infobip.com/glossary/rcs-rich-communication-services",
        "Definition": "RCS is an IP based messaging service provided to mobile phone users through mobile operator networks.",
        "null": [
            "What is RCS Messaging?"
        ]
    },
    {
        "Term": "Return on ad spend (ROAS)",
        "Link": "https://www.infobip.com/glossary/rcs-rich-communication-services",
        "Definition": "RCS is an IP based messaging service provided to mobile phone users through mobile operator networks.",
        "null": [
            "What is RCS Messaging?"
        ]
    },
    {
        "Term": "Risk based authentication",
        "Link": "https://www.infobip.com/glossary/rcs-rich-communication-services",
        "Definition": "RCS is an IP based messaging service provided to mobile phone users through mobile operator networks.",
        "null": [
            "What is RCS Messaging?"
        ]
    },
    {
        "Term": "Roaming",
        "Link": "https://www.infobip.com/glossary/rcs-rich-communication-services",
        "Definition": "RCS is an IP based messaging service provided to mobile phone users through mobile operator networks.",
        "null": [
            "What is RCS Messaging?"
        ]
    },
    {
        "Term": "Robocalls",
        "Link": "https://www.infobip.com/glossary/rcs-rich-communication-services",
        "Definition": "RCS is an IP based messaging service provided to mobile phone users through mobile operator networks.",
        "null": [
            "What is RCS Messaging?"
        ]
    },
    {
        "Term": "RTP",
        "Link": "https://www.infobip.com/glossary/rcs-rich-communication-services",
        "Definition": "RCS is an IP based messaging service provided to mobile phone users through mobile operator networks.",
        "null": [
            "What is RCS Messaging?"
        ]
    },
    {
        "Term": "Schrems II",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from anEU adequacy decision. There is a special list of adequate countries. | The case was brought by Maximilian Schrems, an Austrian lawyer and privacy activist. | Schrems II has significant implications for businesses processing personal data. The judgement declared that companies must comply with applicable EU law and must ensure an adequate level of data protection when transferring personal data to third countries (read as: outside of EU/EEA andadequate countries). | The essence of the Schrems II judgement is that businesses need to control in which country they store their customer’s personal data and, to which countries is this personal data transferred to, and from which countries it’s being accessed. Choosing a provider which can accommodate this will enable businesses to be compliant. | Schrems II benefits end users by providing greater protection for their personal data. The ruling requires businesses to assess the risk associated with data transfers and implement measures that ensure the protection of personal data. | This means that end users can have greater confidence in the businesses they interact with, knowing that their personal data is being accessed only from countries which provide adequate protection. | Schrems II is a significant ruling that has wide ranging implications for businesses and end users. By promoting greater accountability, the ruling has the potential to improve data protection practices and promote privacy rights. Businesses that comply with the ruling can build trust with customers and enhance their reputation in the marketplace. End users can feel confident that their personal data is being protected, which can promote greater confidence and trust in the companies they interact with. | May 9, 2023 | February 24, 2023 | Share"
        ]
    },
    {
        "Term": "Sender of unsolicited emails",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "Sender policy framework (SPF)",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
            ]
    },
    {
        "Term": "Service level agreement (SLA)",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "Session initiation protocol (SIP)",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "Shadow AI",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "Short code",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "Short message service center (SMSC)",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SIM box detection",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SIM card",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "Simjacker",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SMIL",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SMPP",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SMS aggregator",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SMS delivery",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SMS gateway",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SMS gray route",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SMS hubbing",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SMS keyword",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SMS pumping",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SMS spoofing",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SMS termination",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SMS transliteration",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "Software as a Service (SaaS)",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "Spam traps",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "SS7",
        "Link": "https://www.infobip.com/glossary/schrems-ii",
        "Definition": "Schrems II is a landmark case before the European Court of Justice that invalidated the EU US Privacy Shield Framework and imposed additional obligations for transfers of personal data from the EU to any country that does not benefit from an EU adequacy decision. There is a special list of adequate countries.",
        "null": [
            "What is Schrems II?"
        ]
    },
    {
        "Term": "Text to speech",
        "Link": "https://www.infobip.com/glossary/text-to-speech",
        "Definition": "Text to speech is Infobip’s automated service that converts written text into an audio file. It’s being used as a feature of the Voice messages service.",
        "null": [
            "What is text to speech?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Text to Speech is Infobip’s automated service that converts written text into an audio file. It’s being used as a feature of the Voice messages service. | This tool makes written content across platforms easily accessible to people with visual impairments, low literacy, cognitive disabilities, or other barriers. Other key advantages of text to speech include enhanced learning, mobility, freedom, cost effectiveness, and more. | Text to speech takes words on a computer or other digital device using neural networks andmachine learningtechnologies to create synthesized speech outputs from the text. | The voice you hear when activating the text to speech service is computer generated. The reading pace can be sped up or slowed down, and some text to speech tools highlight words as they are read aloud. | Types of text to speech include: | Share | May 24, 2024 | January 17, 2023"
        ]
    },
    {
        "Term": "TON and NPI settings",
        "Link": "https://www.infobip.com/glossary/text-to-speech",
        "Definition": "Text to speech is Infobip’s automated service that converts written text into an audio file. It’s being used as a feature of the Voice messages service.",
        "null": [
            "What is text to speech?"
        ]
    },
    {
        "Term": "Unicode",
        "Link": "https://www.infobip.com/glossary/unicode",
        "Definition": "The Universal Coded Character Set (UCS) or Unicode is an industry standard allowing computers to consistently represent and manipulate text expressed in any of the world’s writing systems.",
        "null": [
            "What is Unicode?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | The Universal Coded Character Set (UCS) or Unicode is an industry standard allowing computers to consistently represent and manipulate text expressed in any of the world’s writing systems. | As an SMS MT feature, it allows any content to be sent within a message. | Unicode and ASCII are computer systems’ two most used character encoding schemes. WhileUnicodeis used to exchange, process, and store text data in any language,ASCIIis used to represent text in the form of symbols, numbers, and characters. | As of Version 15.0, Unicode contains 149,186 characters, but the answer is more complicated than that because of all the different kinds of characters that people might be interested in counting. | Unicode and ISO/IEC 10646 contain the same characters at the exact location, butUnicodehas rules and specifications outside the scope ofISO/IEC 10646. In other words, Unicode offers an extensive set of functional character specifications, data, algorithms, and background material that are not part of ISO/IEC 10646. | Unicode uses two encoding formats, 8 bit and16 bit. The default encoding format is 16 bit, where each character is 16 bits wide (2 bytes), with the form usually shown as U+hhhh, where hhhh is the character’s hexadecimal code point. | For example, “Infobip” written in Unicode looks like: U+0049 U+006E U+0066 U+006F U+0062 U+0069 U+0070. | Share | October 27, 2023 | January 16, 2023"
        ]
    },
    {
        "Term": "Unified communications (UC)",
        "Link": "https://www.infobip.com/glossary/unicode",
        "Definition": "The Universal Coded Character Set (UCS) or Unicode is an industry standard allowing computers to consistently represent and manipulate text expressed in any of the world’s writing systems.",
        "null": [
            "What is Unicode?"
        ]
    },
    {
        "Term": "User data header (UDH)",
        "Link": "https://www.infobip.com/glossary/unicode",
        "Definition": "The Universal Coded Character Set (UCS) or Unicode is an industry standard allowing computers to consistently represent and manipulate text expressed in any of the world’s writing systems.",
        "null": [
            "What is Unicode?"
        ]
    },
    {
        "Term": "USSD",
        "Link": "https://www.infobip.com/glossary/unicode",
        "Definition": "The Universal Coded Character Set (UCS) or Unicode is an industry standard allowing computers to consistently represent and manipulate text expressed in any of the world’s writing systems.",
        "null": [
            "What is Unicode?"
        ]
    },
    {
        "Term": "USSD centre",
        "Link": "https://www.infobip.com/glossary/unicode",
        "Definition": "The Universal Coded Character Set (UCS) or Unicode is an industry standard allowing computers to consistently represent and manipulate text expressed in any of the world’s writing systems.",
        "null": [
            "What is Unicode?"
        ]
    },
    {
        "Term": "Vertex AI",
        "Link": "https://www.infobip.com/glossary/vertex-ai",
        "Definition": "Vertex AI is a Google Cloud service consolidating various AI and machine learning (ML) tools and services into a single ML platform.",
        "null": [
            "What is Vertex AI?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Vertex AI is a Google Cloud service consolidating various AI andmachine learning (ML)tools and services into a single ML platform. This streamlines the entire process of creating, deploying, and managing AI solutions. | Some of Vertex AI features include: | Data scientists and ML engineers can take advantage of Vertex AI in many ways: | Common Vertex AI tools are: | Vertex AI brings a lot of benefits for your business, here are a few: | Google is actively working to address these challenges. | Additionally, following AI development best practices and proactively utilizing the platform’s privacy and cost management features are excellent ways to mitigate potential risks. | A retailer could implement an AI powered RCS chatbot. This chatbot can: | April 26, 2024 | How does Vertex AI accelerate the development of AI? | It utilizes Google’s infrastructure to streamline the training and deployment of models, reducing the time to market for AI solutions. | Is Vertex AI free? | Vertex AI is not a free service. It operates on a pay as you go model, charging you for the specific compute resources and services you utilize within the platform. | March 28, 2024 | March 22, 2024 | March 13, 2024 | Share"
        ]
    },
    {
        "Term": "Virtual long number (VLN)",
        "Link": "https://www.infobip.com/glossary/vertex-ai",
        "Definition": "Vertex AI is a Google Cloud service consolidating various AI and machine learning (ML) tools and services into a single ML platform.",
        "null": [
            "What is Vertex AI?"
        ]
    },
    {
        "Term": "Vishing",
        "Link": "https://www.infobip.com/glossary/vertex-ai",
        "Definition": "Vertex AI is a Google Cloud service consolidating various AI and machine learning (ML) tools and services into a single ML platform.",
        "null": [
            "What is Vertex AI?"
        ]
    },
    {
        "Term": "Voice over Internet Protocol (VoIP)",
        "Link": "https://www.infobip.com/glossary/vertex-ai",
        "Definition": "Vertex AI is a Google Cloud service consolidating various AI and machine learning (ML) tools and services into a single ML platform.",
        "null": [
            "What is Vertex AI?"
        ]
    },
    {
        "Term": "VPN",
        "Link": "https://www.infobip.com/glossary/vertex-ai",
        "Definition": "Vertex AI is a Google Cloud service consolidating various AI and machine learning (ML) tools and services into a single ML platform.",
        "null": [
            "What is Vertex AI?"
        ]
    },
    {
        "Term": "VPN tunnelling",
        "Link": "https://www.infobip.com/glossary/vertex-ai",
        "Definition": "Vertex AI is a Google Cloud service consolidating various AI and machine learning (ML) tools and services into a single ML platform.",
        "null": [
            "What is Vertex AI?"
        ]
    },
    {
        "Term": "WAP push",
        "Link": "https://www.infobip.com/glossary/wap-push",
        "Definition": "WAP push is a mechanism for directing an SMS recipient to a website or landing page without them having to enter a URL in the phone’s browser.",
        "null": [
            "What is WAP push?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | WAP push is a mechanism for directing an SMS recipient to a website or landing page without them having to enter a URL in the phone’s browser. | WAP push works by including a link to the WAP address in the header of the SMS. When a user receives the message containing the link (assuming they are on a device that supports WAP – which almost all modern phones do) the phone will prompt them to open the content, at which time they will be directed to the link address and the content will display. | The acronym WAP stands for Wireless Application Protocol | Typically, WAP Push is used to direct users to marketing content, usually to a landing page displaying a specific offer or promotion, but can also be used for service messages for example displaying Terms and Conditions. | Share | April 5, 2024"
        ]
    },
    {
        "Term": "Webhook",
        "Link": "https://www.infobip.com/glossary/wap-push",
        "Definition": "WAP push is a mechanism for directing an SMS recipient to a website or landing page without them having to enter a URL in the phone’s browser.",
        "null": [
            "What is WAP push?"
        ]
    },
    {
        "Term": "WebRTC",
        "Link": "https://www.infobip.com/glossary/wap-push",
        "Definition": "WAP push is a mechanism for directing an SMS recipient to a website or landing page without them having to enter a URL in the phone’s browser.",
        "null": [
            "What is WAP push?"
                ]
    },
    {
        "Term": "WhatsApp Business API",
        "Link": "https://www.infobip.com/glossary/wap-push",
        "Definition": "WAP push is a mechanism for directing an SMS recipient to a website or landing page without them having to enter a URL in the phone’s browser.",
        "null": [
            "What is WAP push?"
        ]
    },
    {
        "Term": "WhatsApp message template",
        "Link": "https://www.infobip.com/glossary/wap-push",
        "Definition": "WAP push is a mechanism for directing an SMS recipient to a website or landing page without them having to enter a URL in the phone’s browser.",
        "null": [
            "What is WAP push?"
        ]
    },
    {
        "Term": "Workforce optimization (WFO)",
        "Link": "https://www.infobip.com/glossary/wap-push",
        "Definition": "WAP push is a mechanism for directing an SMS recipient to a website or landing page without them having to enter a URL in the phone’s browser.",
        "null": [
            "What is WAP push?"
        ]
    },
    {
        "Term": "WSDL",
        "Link": "https://www.infobip.com/glossary/wap-push",
        "Definition": "WAP push is a mechanism for directing an SMS recipient to a website or landing page without them having to enter a URL in the phone’s browser.",
        "null": [
            "What is WAP push?"
        ]
    },
    {
        "Term": "Zero trust security",
        "Link": "https://www.infobip.com/glossary/zero-trust-security",
        "Definition": "Zero trust security assumes no user, device, or network traffic should be trusted by default, even within the organization's network.",
        "null": [
            "What is zero trust security?",
            " |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Conversational modules | Experiences |  | Moments |  | Conversations |  | Answers |  | People |  | Infobip AI Hub |  | Programmable Channels |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | Platform functionality |  | Block fraudulent OTP traffic |  | Modular API stack to help platforms scale exponentially |  | Customer authentication and verification |  | Check/re verify your mobile number database |  | Root out invalid numbers |  |  | Business segments |  | Build gen AI powered experiences |  | Enable your clients to send traffic at scale |  | Disrupt the world through digital innovation |  | Transform your communication globally |  | Expand your channel offering at scale | Industry verticals |  | Reassure customers with secure interactions |  | Boost conversion and increase customer loyalty |  | Build superior CX solutions across the entire telecom customer journey |  | Deliver a fast, convenient patient experience in person or at home |  | Deliver superior transportation and logistics customer experience |  | Transforming citizen engagement with AI | Department |  | Unleash the power of omnichannel marketing automation |  | Optimize your sales with intelligent automation |  | Provide efficient customer service on the most popular channels | Our services |  | Maximize return on yourCX investments |  | Ensure early and sustainable ROI on your CX investments |  | Find out how to reach your full conversational potential | Solutions for telecoms |  | See why leading telecoms around the world choose Infobip to transform their network |  | Create new B2B revenue streams with our omnichannel communications platform |  | Build superior CX solutions across the entire telecom customer journey | Telecom core & security |  | Secure your network from SMS and Voice fraud with our firewall that protects 120+ operators |  | Ensure all A2P SMS traffic is properly charged and eliminate revenue leakage with our SMS Firewall |  | Tap into the core of telecom networks, and deliver unparalleled customer experiences |  | Leverage RCS for telecoms to increase connectivity globally | Featured cases | API & TOOLS |  |  |  |  |  |  |  |  |  |  | Community & Resources |  | Newsletter & magazine for developers |  | Leading developers conference in Southern Europe |  |  |  |  |  |  | Knowledge hub |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | News CentEr |  |  |  |  |  |  |  |  |  |  | Featured content |  |  |  | Zero trust securityis a modern approach to cybersecurity that operates on the principle of “never trust, always verify.” It assumes no user, device, or network traffic should be trusted by default, even within the organization’s network perimeter. | Instead, the zero trust approach continuously verifies the identity and authorization of every user and device for every access request, ensuring that only authorized individuals and devices can access sensitive information and systems. | In 2009, Forrester analyst John Kindervag coined the term “zero trust” and introduced it as a new security model to address the limitations of traditional perimeter based security. Forrester’s research and publications on zero trust have been instrumental in shaping the understanding and adoption of this approach. They have developed the Zero Trust eXtended (ZTX) framework, which provides a comprehensive approach to implementing zero trust in organizations. | In practice, zero trust security works by implementing multiple security measures that continuously assessriskand grant access based on a dynamic trust evaluation. Here’s how it works: | Passwordless authentication is a way to identify your identity without using a password. Instead, it uses more secure alternatives like possession factors or biometrics. | Adopting a zero trust architecture offers numerous benefits for organizations of all sizes, helping them strengthen their security posture and protect their valuable assets: | Zero trust architecture can be applied to various scenarios, offering enhanced security and risk mitigation across different areas: | Developing a robust zero trust strategy requires a thoughtful and systematic approach. Here’s how to start: | How is zero trust different from traditional security? | Traditional security is like a castle with a moat—it focuses on protecting the perimeter but assumes everything inside is safe. Zero trust, on the other hand, acknowledges that threats can come from anywhere, even within the organization. It’s about continuously monitoring and verifying everyone and everything, not just at the entrance. | Is zero trust only for big companies? | Not at all! Zero trust principles can be adapted to organizations of any size. | Isn’t zero trust too complex and expensive? | It doesn’t have to be. Zero trust can be implemented incrementally, starting with the most critical assets and gradually expanding to other areas. | Multifactor authentication (MFA) is a security method that requires users to provide 2 or more verification factors to access an account. | Password hashing is a process that transforms your password into a jumbled, unrecognizable string of characters (the “hash”). | Risk based authentication (RBA) dynamically assesses the risk level of each login attempt or transaction based on the risk and context. | Passwordless authentication is a way to identify your identity without using a password. Instead, it uses more secure alternatives like possession factors or biometrics. | Discover the challenges and solutions for secure conversational banking. Get expert insights from Stephen Gilmore, owner of Status Data. | Help your users avoid the heartache of romance scams by keeping them safe with Mobile Identity. | Generative AI is here and we marvel at its astounding powers. But, can these powers be used for more nefarious purposes? Read to find out more! | Share"
        ]
    }
]